// #include<stdio.h>
// //求所有水仙花数（三位数中）
// // 输出所有的“水仙花数”，
// // 所谓的“水仙花数”是指一个三位数其各位数字的立方和等于该数本身，
// // 例如153是“水仙花数”，因为：153 = 13 + 53 + 33。
// int main()
// {
//     //定义一个三位数n
//     int n = 100;


//     //判断n是否为水仙花数
//     while (n >= 100 && n <= 999)
//     {
//         int i,j,k;
//         i=n/100;
//         j=n/10%10;
//         k=n%10;
//         if (i*i*i + j*j*j + k*k*k == n)
//         {
//             printf("%d ", n);
//         }
//         n++;
//     }
   
//     return 0;
// }